"""
    该案例对比面向过程编程、面向函数式编程、面向对象编程

    准备做如下3道菜，通过程序描述出没道菜的做菜流程
    东北大拉皮
    东北大乱炖
    小酥肉
"""

# 面向对象的编程
class 菜:
    def __init__(self,name):
        self.name = name

    def 洗(self,clm):
        print(f"{self.name}洗{clm}")

    def 切(self,clm):
        print(f"{self.name}切{clm}")

    def 拌(self,*clm):
        print(f"{self.name}拌{clm}")

    def 炖(self,*clm):
        print(f"{self.name}炖{clm}")

    def 炸(self,clm):
        print(f"{self.name}炸{clm}")

    def 上菜(self):
        print(f"{self.name}上菜")

dlp = 菜("东北大拉皮")
dlp.洗("黄瓜")
dlp.洗("拉皮")
dlp.切("黄瓜")
dlp.拌("黄瓜","拉皮","调料")
dlp.上菜()


"""
面向函数的编程方式
def 东北大拉皮(func):
    洗("黄瓜")
    洗("拉皮")
    切("黄瓜")
    拌("黄瓜", "拉皮", "调料")
    上菜("东北大拉皮")

def 东北大乱炖():
    洗("白菜")
    洗("豆角")
    洗("土豆")
    切("肉")
    炖("白菜", "土豆", "豆角", "肉", "玉米", "粉条", "调料")
    上菜("东北大乱炖")

def 小酥肉():
    洗("肉")
    切("肉")
    拌("肉", "淀粉")
    炸("肉")
    上菜("小酥肉")
    print("~" * 30)
东北大拉皮()
东北大乱炖()
小酥肉()
"""


"""
    面向过程的编程方式
        适合一些简单的流程和步骤，如果业务比较复杂，不太合适
# 东北大拉皮
洗("黄瓜")
洗("拉皮")
切("黄瓜")
拌("黄瓜","拉皮","调料")
上菜("东北大拉皮")
print("~"*30)
# 东北大乱炖
洗("白菜")
洗("豆角")
洗("土豆")
切("肉")
炖("白菜","土豆","豆角","肉","玉米","粉条","调料")
上菜("东北大乱炖")
print("~"*30)
# 小酥肉
洗("肉")
切("肉")
拌("肉","淀粉")
炸("肉")
上菜("小酥肉")
print("~"*30)
"""




